In [1]:
import pandas as pd

Документация по использованию всех функций и методов библиотеки: http://pandas.pydata.org/pandas-docs/stable/index.html

# Основные объекты Pandas

### Series

In [2]:
s = pd.Series(data = [1,2,3,4,5], index = 'one two three four five'.split())

In [3]:
# Обращаемся ко всей серии данных или к отдельному элементу 
s['five']

5

### DataFrame

In [4]:
df = pd.DataFrame({'name': 'Иванов Петров Сидоров'.split(), 
                   'age': [25, 41, 18]}, 
                  index = [12345, 24242, 56554])

In [5]:
df

          name  age
12345   Иванов   25
24242   Петров   41
56554  Сидоров   18

In [6]:
# Извлекаем весь столбец
df.age

12345    25
24242    41
56554    18
Name: age, dtype: int64

In [7]:
# Извлекаем отдельный элемент, способ 1 (используем значения индексов и названия столбцов)
df['age'][12345]

25

In [9]:
# Извлекаем отдельный элемент, способ 2 (используем номера строк и столбцов)
df.iloc[0][1]

25

In [13]:
# Объединяем два способа
df['age'].iloc[0]

25

In [14]:
df.index

Int64Index([12345, 24242, 56554], dtype='int64')

# Загружаем датасет и смотрим, что в нем есть

Для работы будем использовать известный датасет, содержащий информацию о пассажирах Титаника. Скачать датасет и посмотреть его описание можно по адресу: https://www.kaggle.com/c/titanic/data (требуется регистрация).  
Скачать без регистрации: https://drive.google.com/open?id=1zy9JKp-bTfF0gRYkGl-g0X4o72NAhl1u

In [16]:
df = pd.read_csv('train.csv')

In [17]:
# Смотрим на содержимое первых строк датафрейма
df.tail(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

In [18]:
# Получаем общую информацию о датафрейме
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 66.2+ KB

In [19]:
# Получаем основные статистические данные о количественных показателях
#Будьте осторожны с этим методом при работе с большими датасетами!
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [20]:
# Поворачиваем таблицу
df.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

Можно вывести на экран только определённые столбцы:

In [21]:
# Задание: вывести на экран имена, возраст и класс каюты первых десяти пассажиров
df[['Name','Age','Pclass']].head(10)

                                                Name   Age  Pclass
0                            Braund, Mr. Owen Harris  22.0       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1
2                             Heikkinen, Miss. Laina  26.0       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1
4                           Allen, Mr. William Henry  35.0       3
5                                   Moran, Mr. James   NaN       3
6                            McCarthy, Mr. Timothy J  54.0       1
7                     Palsson, Master. Gosta Leonard   2.0       3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0       3
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0       2

### Фильтрация данных

In [22]:
# Выведем данные только о пассажирах 1 класса (первые 10 строк):
df[df['Pclass'] == 1].head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S

Считаем дополнительные статистические показатели для определённого столбца:

In [23]:
# Найдем минимальную стоимость билета:
df['Fare'].min()

0.0

In [24]:
# Найдем минимальную стоимость билета отдельно для взрослого пассажира и для ребенка:
df[df['Age'] >= 18].Fare.min()

0.0

In [25]:
df[df['Age'] < 18].Fare.min()

7.0542

In [26]:
# Найдем возраст самого страшего пассажира, путешествовавшего по бесплатному билету
df[df['Fare'] == 0].Age.max()

49.0

In [27]:
df[df['Fare'] == 0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,NaN,S
466,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0,NaN,S
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0,NaN,S
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S

In [28]:
# Найдем минимальную стоимость платных билетов для взрослых:
df[(df['Fare'] > 0) & (df.Age >= 18)].Fare.min()

4.0125

In [29]:
# Найдем среднюю стоимость билета в первом классе
print(df[df['Pclass'] == 1].Fare.mean())

84.15468749999992

In [30]:
# Найдем среднюю стоимость билета в первом классе без учета бесплатных билетов
df[(df.Pclass==1) & df['Fare'] > 0].Fare.mean()

86.14887440758287

# Эксперименты с группировками

## value_counts()

In [39]:
# Посчитаем статистику выживших и погибших
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [40]:
# Посчитаем статистику выживших и погибших среди мужчин
df[df['Sex'] == 'male']['Survived'].value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [41]:
# Посчитаем статистику выживших и погибших среди женщин
df[df['Sex'] == 'female']['Survived'].value_counts()

1    233
0     81
Name: Survived, dtype: int64

In [42]:
# Организуем вывод обобщенных данных о погибших и выживших среди мужчин и женщин
for sex in df['Sex'].unique():
    if sex == 'male':
        print('Данные о мужчинах')
    else:
        print('Данные о женщинах')
    print(df[df['Sex']==sex]['Survived'].value_counts())
    print()

Данные о мужчинах
0    468
1    109
Name: Survived, dtype: int64

Данные о женщинах
1    233
0     81
Name: Survived, dtype: int64

In [43]:
# Посчитаем статистику выживших и погибших среди пассажиров 1 класса
df[df['Pclass'] == 1]['Survived'].value_counts()

1    136
0     80
Name: Survived, dtype: int64

In [44]:
# Посчитаем обобщенные данные по классам и полу
for sex in df['Sex'].unique():
    if sex == 'male':
        print('Данные о мужчинах')
    else:
        print('Данные о женщинах')
    for pclass in [1,2,3]:
        print(pclass, 'класс:')
        print(df[(df['Pclass'] == pclass) & (df['Sex']==sex)]['Survived'].value_counts())
    print()

Данные о мужчинах
1 класс:
0    77
1    45
Name: Survived, dtype: int64
2 класс:
0    91
1    17
Name: Survived, dtype: int64
3 класс:
0    300
1     47
Name: Survived, dtype: int64

Данные о женщинах
1 класс:
1    91
0     3
Name: Survived, dtype: int64
2 класс:
1    70
0     6
Name: Survived, dtype: int64
3 класс:
1    72
0    72
Name: Survived, dtype: int64

## groupby()

In [45]:
# Считаем средний возраст выживших и погибших
# (сгруппируем пассажиров по столбцу 'Survived' и посчитаем средний возраст в каждой группе)
df.groupby(by = 'Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [47]:
# Считаем средний возраст выживших и погибших по классам
# (сгруппируем пассажиров по столбцам 'Survived'и 'Pclass' и посчитаем средний возраст в каждой группе)
df.groupby(by = ['Pclass', 'Survived'])['Age'].mean()

Pclass  Survived
1       0           43.695312
        1           35.368197
2       0           33.544444
        1           25.901566
3       0           26.555556
        1           20.646118
Name: Age, dtype: float64

In [51]:
# Считаем количество выживших и погибших в зависимости от класса и пола
df.groupby(by = ['Survived','Pclass', 'Sex'])['Survived'].count()

Survived  Pclass  Sex
0         1       female      3
                  male       61
          2       female      6
                  male       84
          3       female     55
                  male      215
1         1       female     82
                  male       40
          2       female     68
                  male       15
          3       female     47
                  male       38
Name: Age, dtype: int64

In [52]:
# Считаем минимальную, среднюю и максимальную стоимость билетов по классам (исключая бесплатные билеты)
df[df.Fare != 0].groupby(by = 'Pclass')['Fare'].agg(['min', 'mean', 'max'])

            min       mean       max
Pclass
1        5.0000  86.148874  512.3292
2       10.5000  21.358661   73.5000
3        4.0125  13.787875   69.5500

In [ ]:
# Считаем минимальные и максимальные возраст и сумму оплаты по классам для выживших и погибших пассажиров

In [53]:
# Считаем минимальную, среднюю и максимальную стоимость билета для пассажиров в зависимости от пола и класса
df[df.Fare!=0].groupby(by = ['Pclass', 'Sex'])['Fare'].agg(['min','mean','max'])

                   min        mean       max
Pclass Sex
1      female  25.9292  106.125798  512.3292
       male     5.0000   70.099038  512.3292
2      female  10.5000   21.970121   65.0000
       male    10.5000   20.903064   73.5000
3      female   6.7500   16.118810   69.5500
       male     4.0125   12.809290   69.5500

## pivot_table()

In [54]:
# Считаем средний возраст выживших и погибших пассажиров по классам
df.pivot_table(values = 'Age', index = 'Pclass', columns = 'Survived', aggfunc = 'mean')

Survived          0          1
Pclass
1         43.695312  35.368197
2         33.544444  25.901566
3         26.555556  20.646118

In [56]:
# Считаем минимальную, максимальную и среднюю стоимость билета 
# для выживших и погибших пассажиров в зависимости от класса
df[df.Fare != 0].pivot_table(values = 'Fare', index = 'Pclass', columns = 'Survived', aggfunc = ['min','mean','max'])

              min                mean                max
Survived        0        1          0          1       0         1
Pclass
1          5.0000  25.9292  68.996275  95.608029  263.00  512.3292
2         10.5000  10.5000  20.692262  22.055700   73.50   65.0000
3          4.0125   6.9750  13.780497  13.810946   69.55   56.4958

Извлекаем из полученных данных информацию о конкретной категории пассажиров

In [57]:
# Помещаем сгруппированные данные в отдельный датафрейм:
temp = df[df.Fare != 0].pivot_table(values = 'Fare', index = 'Pclass', columns = 'Survived', aggfunc = ['min','mean','max'])

In [58]:
# Извлекаем среднюю стоимость билета для погибших пассажиров 1 класса:
temp['mean'][0][1]

68.9962746666667

In [59]:
df.pivot_table(values = 'Fare', index = 'Pclass', columns = 'Survived', aggfunc = ['min','mean','max'])

          min                mean                max
Survived    0        1          0          1       0         1
Pclass
1         0.0  25.9292  64.684008  95.608029  263.00  512.3292
2         0.0  10.5000  19.412328  22.055700   73.50   65.0000
3         0.0   0.0000  13.669364  13.694887   69.55   56.4958

In [ ]:
# Считаем среднее количесто братьев, сестер и супругов ('SibSp'), 
# которые путешествовали с выжившими и погибшими пассажирами разных классов

Датасет для тренировки полученных навыков: https://www.kaggle.com/lava18/google-play-store-apps

### Слияние таблиц

In [63]:
df2 = pd.read_csv('sexes.csv')

In [64]:
df2

      Sex Russian_name
0    male      мужчина
1  female      женщина

In [65]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [66]:
df3 = df.merge(df2, on = 'Sex')

In [68]:
df3.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Russian_name
886,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,женщина
887,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,женщина
888,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,женщина
889,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,женщина
890,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,женщина